import React from "react";

const Blogs = () => {
    return (
        <div className="h-screen mx-12">
            <div className=" bg-slate-300 p-6 rounded-lg mb-8">
                <p className="text-justify">
                    <b>
                        1) আপনি কিভাবে একটি React অ্যাপ্লিকেশনের কর্মক্ষমতা
                        উন্নত করবেন?
                    </b>
                    <br />
                    Answer ➤ UI আপডেট করার জন্য প্রয়োজনীয় ব্যয়বহুল DOM
                    অপারেশনের সংখ্যা কমাতে অভ্যন্তরীণভাবে প্রতিক্রিয়াতে বেশ
                    কিছু চতুর কর্মক্ষমতা অপ্টিমাইজেশান কৌশল ব্যবহার করা হয়। এটি
                    সাধারণত অনেক ক্ষেত্রে পারফরম্যান্সের জন্য বিশেষভাবে
                    অপ্টিমাইজ না করে একটি দ্রুত ব্যবহারকারী ইন্টারফেসের দিকে
                    নিয়ে যায় এবং এমন কিছু উপায় রয়েছে যেখানে আপনি এখনও আপনার
                    প্রতিক্রিয়া অ্যাপ্লিকেশনটিকে দ্রুত করতে পারেন। আমরা যখন
                    রিঅ্যাক্ট অ্যাপের প্রোডাকশন বিল্ড তৈরি করি, তখন এনপিএম রান
                    বিল্ড অ্যাপটির প্রোডাকশন বিল্ড সহ একটি বিল্ড ডিরেক্টরি তৈরি
                    করবে।
                </p>
            </div>
            <div className=" bg-orange-300 p-6 rounded-lg mb-8">
                <p className="text-justify">
                    <b>
                        2) একটি React অ্যাপ্লিকেশনে একটি State পরিচালনা করার
                        বিভিন্ন উপায় কি কি?
                    </b>
                    <br />
                    Answer ➤ State পরিচালনা করা তর্কাতীতভাবে যেকোনো
                    অ্যাপ্লিকেশনের সবচেয়ে কঠিন অংশ। এই কারণেই এখানে অনেকগুলি
                    state ব্যবস্থাপনা লাইব্রেরি উপলব্ধ রয়েছে এবং আরও প্রতিদিন
                    প্রায় আসছে। stateপরিচালনা একটি কঠিন সমস্যা হওয়া সত্ত্বেও,
                    আমি পরামর্শ দেব যে একটি জিনিস যা এটিকে এত কঠিন করে তোলে তা
                    হল যে আমরা প্রায়শই সমস্যার সমাধানকে অতিরিক্ত প্রকৌশলী করি।
                    একটি স্টেট ম্যানেজমেন্ট সলিউশন আছে যা আমি ব্যক্তিগতভাবে
                    প্রয়োগ করার চেষ্টা করেছি যতদিন আমি রিঅ্যাক্ট ব্যবহার করছি,
                    এবং রিঅ্যাক্ট হুক প্রকাশের সাথে সাথে, state পরিচালনার এই
                    পদ্ধতিটি অত্যন্ত সরলীকৃত হয়েছে।
                </p>
            </div>
            <div className=" bg-cyan-300 p-6 rounded-lg mb-8">
                <p className="text-justify">
                    <b>3) প্রোটোটাইপিকাল উত্তরাধিকার কিভাবে কাজ করে?</b>
                    <br />
                    Answer ➤ জাভাস্ক্রিপ্ট একটি প্রোটোটাইপ-ভিত্তিক,
                    অবজেক্ট-ওরিয়েন্টেড প্রোগ্রামিং ভাষা। ES6 আপডেটের পরে,
                    জাভাস্ক্রিপ্ট "প্রোটোটাইপল উত্তরাধিকার" এর জন্য অনুমতি
                    দিয়েছে, যার অর্থ বস্তু এবং পদ্ধতিগুলি ভাগ করা, প্রসারিত এবং
                    অনুলিপি করা যেতে পারে। বস্তুর মধ্যে ভাগ করা কাঠামোর সহজ
                    উত্তরাধিকার (ডেটা ক্ষেত্র), আচরণ (ফাংশন/পদ্ধতি), এবং অবস্থা
                    (ডেটা মান) তৈরি করে।
                </p>
            </div>
        </div>
    );
};

export default Blogs;
